---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevTextHorizOffset
source: html/25d2ef55-5e78-6934-89a5-f11aba893e1b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevTextHorizOffset Property

"Text Offset from Symbol"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevTextHorizOffset { get; }
```